# -*- coding: utf-8 -*-
# Tamil letter frequency Analyzer

import sys
from tamil import utf8

def getLetterCount(word):
    
    # Dictionary to store count of letters
       
    tamil_dict = {"க்": 0,"க": 0,"கா": 0,"கி": 0,"கீ": 0,"கு": 0,"கூ": 0,"கெ": 0,"கே": 0,"கை": 0,"கொ": 0,"கோ": 0,"கௌ": 0,"ங்": 0,"ங": 0,"ஙா": 0,"ஙி": 0,"ஙீ": 0,"ஙு": 0,"ஙூ": 0,"ஙெ": 0,"ஙே": 0,"ஙை": 0,"ஙொ": 0,"ஙோ": 0,"ஙௌ": 0,"ச்": 0,"ச": 0,"சா": 0,"சி": 0,"சீ": 0,"சு": 0,"சூ": 0,"செ": 0,"சே": 0,"சை": 0,"சொ": 0,"சோ": 0,"சௌ": 0,"ஞ்": 0,"ஞ": 0,"ஞா": 0,"ஞி": 0,"ஞீ": 0,"ஞு": 0,"ஞூ": 0,"ஞெ": 0,"ஞே": 0,"ஞை": 0,"ஞொ": 0,"ஞோ": 0,"ஞௌ": 0,"ட்": 0,"ட": 0,"டா": 0,"டி": 0,"டீ": 0,"டு": 0,"டூ": 0,"டெ": 0,"டே": 0,"டை": 0,"டொ": 0,"டோ": 0,"டௌ": 0,"ண்": 0,"ண": 0,"ணா": 0,"ணி": 0,"ணீ": 0,"ணு": 0,"ணூ": 0,"ணெ": 0,"ணே": 0,"ணை": 0,"ணொ": 0,"ணோ": 0,"ணௌ": 0,"த்": 0,"த": 0,"தா": 0,"தி": 0,"தீ": 0,"து": 0,"தூ": 0,"தெ": 0,"தே": 0,"தை": 0,"தொ": 0,"தோ": 0,"தௌ": 0,"ந்": 0,"ந": 0,"நா": 0,"நி": 0,"நீ": 0,"நு": 0,"நூ": 0,"நெ": 0,"நே": 0,"நை": 0,"நொ": 0,"நோ": 0,"நௌ": 0,"ப்": 0,"ப": 0,"பா": 0,"பி": 0,"பீ": 0,"பு": 0,"பூ": 0,"பெ": 0,"பே": 0,"பை": 0,"பொ": 0,"போ": 0,"பௌ": 0,"ம்": 0,"ம": 0,"மா": 0,"மி": 0,"மீ": 0,"மு": 0,"மூ": 0,"மெ": 0,"மே": 0,"மை": 0,"மொ": 0,"மோ": 0,"மௌ": 0,"ய்": 0,"ய": 0,"யா": 0,"யி": 0,"யீ": 0,"யு": 0,"யூ": 0,"யெ": 0,"யே": 0,"யை": 0,"யொ": 0,"யோ": 0,"யௌ": 0,"ர்": 0,"ர": 0,"ரா": 0,"ரி": 0,"ரீ": 0,"ரு": 0,"ரூ": 0,"ரெ": 0,"ரே": 0,"ரை": 0,"ரொ": 0,"ரோ": 0,"ரௌ": 0,"ல்": 0,"ல": 0,"லா": 0,"லி": 0,"லீ": 0,"லு": 0,"லூ": 0,"லெ": 0,"லே": 0,"லை": 0,"லொ": 0,"லோ": 0,"லௌ": 0,"வ்": 0,"வ": 0,"வா": 0,"வி": 0,"வீ": 0,"வு": 0,"வூ": 0,"வெ": 0,"வே": 0,"வை": 0,"வொ": 0,"வோ": 0,"வௌ": 0,"ழ்": 0,"ழ": 0,"ழா": 0,"ழி": 0,"ழீ": 0,"ழு": 0,"ழூ": 0,"ழெ": 0,"ழே": 0,"ழை": 0,"ழொ": 0,"ழோ": 0,"ழௌ": 0,"ள்": 0,"ள": 0,"ளா": 0,"ளி": 0,"ளீ": 0,"ளு": 0,"ளூ": 0,"ளெ": 0,"ளே": 0,"ளை": 0,"ளொ": 0,"ளோ": 0,"ளௌ": 0,"ற்": 0,"ற": 0,"றா": 0,"றி": 0,"றீ": 0,"று": 0,"றூ": 0,"றெ": 0,"றே": 0,"றை": 0,"றொ": 0,"றோ": 0,"றௌ": 0,"ன்": 0,"ன": 0,"னா": 0,"னி": 0,"னீ": 0,"னு": 0,"னூ": 0,"னெ": 0,"னே": 0,"னை": 0,"னொ": 0,"னோ": 0,"னௌ": 0,"அ": 0,"ஆ": 0,"இ": 0,"ஈ": 0,"உ": 0,"ஊ": 0,"எ": 0,"ஏ": 0,"ஐ": 0,"ஒ": 0,"ஓ": 0,"ஔ": 0,"ஃ": 0}
    uyir_dict = {"அ": 0,"ஆ": 0,"இ": 0,"ஈ": 0,"உ": 0,"ஊ": 0,"எ": 0,"ஏ": 0,"ஐ": 0,"ஒ": 0,"ஓ": 0,"ஔ": 0}
    mei_dict= {"க்": 0,"ங்": 0,"ச்": 0,"ஞ்": 0,"ட்": 0,"ண்": 0,"த்": 0,"ந்": 0,"ப்": 0,"ம்": 0,"ய்": 0,"ர்": 0,"ல்": 0,"வ்": 0,"ழ்": 0,"ள்": 0,"ற்": 0,"ன்": 0}
    uyirmei_dict = {"க": 0,"கா": 0,"கி": 0,"கீ": 0,"கு": 0,"கூ": 0,"கெ": 0,"கே": 0,"கை": 0,"கொ": 0,"கோ": 0,"கௌ": 0,"ங": 0,"ஙா": 0,"ஙி": 0,"ஙீ": 0,"ஙு": 0,"ஙூ": 0,"ஙெ": 0,"ஙே": 0,"ஙை": 0,"ஙொ": 0,"ஙோ": 0,"ஙௌ": 0,"ச": 0,"சா": 0,"சி": 0,"சீ": 0,"சு": 0,"சூ": 0,"செ": 0,"சே": 0,"சை": 0,"சொ": 0,"சோ": 0,"சௌ": 0,"ஞ": 0,"ஞா": 0,"ஞி": 0,"ஞீ": 0,"ஞு": 0,"ஞூ": 0,"ஞெ": 0,"ஞே": 0,"ஞை": 0,"ஞொ": 0,"ஞோ": 0,"ஞௌ": 0,"ட": 0,"டா": 0,"டி": 0,"டீ": 0,"டு": 0,"டூ": 0,"டெ": 0,"டே": 0,"டை": 0,"டொ": 0,"டோ": 0,"டௌ": 0,"ண": 0,"ணா": 0,"ணி": 0,"ணீ": 0,"ணு": 0,"ணூ": 0,"ணெ": 0,"ணே": 0,"ணை": 0,"ணொ": 0,"ணோ": 0,"ணௌ": 0,"த": 0,"தா": 0,"தி": 0,"தீ": 0,"து": 0,"தூ": 0,"தெ": 0,"தே": 0,"தை": 0,"தொ": 0,"தோ": 0,"தௌ": 0,"ந": 0,"நா": 0,"நி": 0,"நீ": 0,"நு": 0,"நூ": 0,"நெ": 0,"நே": 0,"நை": 0,"நொ": 0,"நோ": 0,"நௌ": 0,"ப": 0,"பா": 0,"பி": 0,"பீ": 0,"பு": 0,"பூ": 0,"பெ": 0,"பே": 0,"பை": 0,"பொ": 0,"போ": 0,"பௌ": 0,"ம": 0,"மா": 0,"மி": 0,"மீ": 0,"மு": 0,"மூ": 0,"மெ": 0,"மே": 0,"மை": 0,"மொ": 0,"மோ": 0,"மௌ": 0,"ய": 0,"யா": 0,"யி": 0,"யீ": 0,"யு": 0,"யூ": 0,"யெ": 0,"யே": 0,"யை": 0,"யொ": 0,"யோ": 0,"யௌ": 0,"ர": 0,"ரா": 0,"ரி": 0,"ரீ": 0,"ரு": 0,"ரூ": 0,"ரெ": 0,"ரே": 0,"ரை": 0,"ரொ": 0,"ரோ": 0,"ரௌ": 0,"ல": 0,"லா": 0,"லி": 0,"லீ": 0,"லு": 0,"லூ": 0,"லெ": 0,"லே": 0,"லை": 0,"லொ": 0,"லோ": 0,"லௌ": 0,"வ": 0,"வா": 0,"வி": 0,"வீ": 0,"வு": 0,"வூ": 0,"வெ": 0,"வே": 0,"வை": 0,"வொ": 0,"வோ": 0,"வௌ": 0,"ழ": 0,"ழா": 0,"ழி": 0,"ழீ": 0,"ழு": 0,"ழூ": 0,"ழெ": 0,"ழே": 0,"ழை": 0,"ழொ": 0,"ழோ": 0,"ழௌ": 0,"ள": 0,"ளா": 0,"ளி": 0,"ளீ": 0,"ளு": 0,"ளூ": 0,"ளெ": 0,"ளே": 0,"ளை": 0,"ளொ": 0,"ளோ": 0,"ளௌ": 0,"ற": 0,"றா": 0,"றி": 0,"றீ": 0,"று": 0,"றூ": 0,"றெ": 0,"றே": 0,"றை": 0,"றொ": 0,"றோ": 0,"றௌ": 0,"ன": 0,"னா": 0,"னி": 0,"னீ": 0,"னு": 0,"னூ": 0,"னெ": 0,"னே": 0,"னை": 0,"னொ": 0,"னோ": 0,"னௌ": 0}
    uyirkuril_dict = {"அ": 0,"இ": 0,"உ": 0,"எ": 0,"ஒ": 0}
    uyirnaedil_dict = {"ஆ": 0,"ஈ": 0,"ஊ": 0,"ஏ": 0,"ஐ": 0,"ஓ": 0,"ஔ": 0}
    uyirmeikuril_dict = {"க": 0,"கி": 0,"கு": 0,"கெ": 0,"கொ": 0,"ங": 0,"ஙி": 0,"ஙு": 0,"ஙெ": 0,"ஙொ": 0,"ச": 0,"சி": 0,"சு": 0,"செ": 0,"சொ": 0,"ஞ": 0,"ஞி": 0,"ஞு": 0,"ஞெ": 0,"ஞொ": 0,"ட": 0,"டி": 0,"டு": 0,"டெ": 0,"டொ": 0,"ண": 0,"ணி": 0,"ணு": 0,"ணெ": 0,"ணொ": 0,"த": 0,"தி": 0,"து": 0,"தெ": 0,"தொ": 0,"ந": 0,"நி": 0,"நு": 0,"நெ": 0,"நொ": 0,"ப": 0,"பி": 0,"பு": 0,"பெ": 0,"பொ": 0,"ம": 0,"மி": 0,"மு": 0,"மெ": 0,"மொ": 0,"ய": 0,"யி": 0,"யு": 0,"யெ": 0,"யொ": 0,"ர": 0,"ரி": 0,"ரு": 0,"ரெ": 0,"ரொ": 0,"ல": 0,"லி": 0,"லு": 0,"லெ": 0,"லொ": 0,"வ": 0,"வி": 0,"வு": 0,"வெ": 0,"வொ": 0,"ழ": 0,"ழி": 0,"ழு": 0,"ழெ": 0,"ழொ": 0,"ள": 0,"ளி": 0,"ளு": 0,"ளெ": 0,"ளொ": 0,"ற": 0,"றி": 0,"று": 0,"றெ": 0,"றொ": 0,"ன": 0,"னி": 0,"னு": 0,"னெ": 0,"னொ": 0}
    uyirmeinaedil_dict = {"கா": 0,"கீ": 0,"கூ": 0,"கே": 0,"கை": 0,"கோ": 0,"கௌ": 0,"ஙா": 0,"ஙீ": 0,"ஙூ": 0,"ஙே": 0,"ஙை": 0,"ஙோ": 0,"ஙௌ": 0,"சா": 0,"சீ": 0,"சூ": 0,"சே": 0,"சை": 0,"சோ": 0,"சௌ": 0,"ஞா": 0,"ஞீ": 0,"ஞூ": 0,"ஞே": 0,"ஞை": 0,"ஞோ": 0,"ஞௌ": 0,"டா": 0,"டீ": 0,"டூ": 0,"டே": 0,"டை": 0,"டோ": 0,"டௌ": 0,"ணா": 0,"ணீ": 0,"ணூ": 0,"ணே": 0,"ணை": 0,"ணோ": 0,"ணௌ": 0,"தா": 0,"தீ": 0,"தூ": 0,"தே": 0,"தை": 0,"தோ": 0,"தௌ": 0,"நா": 0,"நீ": 0,"நூ": 0,"நே": 0,"நை": 0,"நோ": 0,"நௌ": 0,"பா": 0,"பீ": 0,"பூ": 0,"பே": 0,"பை": 0,"போ": 0,"பௌ": 0,"மா": 0,"மீ": 0,"மூ": 0,"மே": 0,"மை": 0,"மோ": 0,"மௌ": 0,"யா": 0,"யீ": 0,"யூ": 0,"யே": 0,"யை": 0,"யோ": 0,"யௌ": 0,"ரா": 0,"ரீ": 0,"ரூ": 0,"ரே": 0,"ரை": 0,"ரோ": 0,"ரௌ": 0,"லா": 0,"லீ": 0,"லூ": 0,"லே": 0,"லை": 0,"லோ": 0,"லௌ": 0,"வா": 0,"வீ": 0,"வூ": 0,"வே": 0,"வை": 0,"வோ": 0,"வௌ": 0,"ழா": 0,"ழீ": 0,"ழூ": 0,"ழே": 0,"ழை": 0,"ழோ": 0,"ழௌ": 0,"ளா": 0,"ளீ": 0,"ளூ": 0,"ளே": 0,"ளை": 0,"ளோ": 0,"ளௌ": 0,"றா": 0,"றீ": 0,"றூ": 0,"றே": 0,"றை": 0,"றோ": 0,"றௌ": 0,"னா": 0,"னீ": 0,"னூ": 0,"னே": 0,"னை": 0,"னோ": 0,"னௌ": 0}
    
    #List of letters to compare against 
    #uyir_list=['அ','ஆ','இ','ஈ','உ','ஊ','எ','ஏ','ஐ','ஒ','ஓ','ஔ','ஃ']
    #mei_list=['க்','ங்','ச்','ஞ்','ட்','ண்','த்','ந்','ப்','ம்','ய்','ர்','ல்','வ்','ழ்','ள்','ற்','ன்']
    #uyirkuril_list=['அ','இ','உ','எ','ஒ']
    #uyirnaedil_list=['ஆ','ஈ','ஊ','ஏ','ஐ','ஓ','ஔ']
    #uyirmeikuril_list=['க','கி','கு','கெ','கொ','ங','ஙி','ஙு','ஙெ','ஙொ','ச','சி','சு','செ','சொ','ஞ','ஞி','ஞு','ஞெ','ஞொ','ட','டி','டு','டெ','டொ','ண','ணி','ணு','ணெ','ணொ','த','தி','து','தெ','தொ','ந','நி','நு','நெ','நொ','ப','பி','பு','பெ','பொ','ம','மி','மு','மெ','மொ','ய','யி','யு','யெ','யொ','ர','ரி','ரு','ரெ','ரொ','ல','லி','லு','லெ','லொ','வ','வி','வு','வெ','வொ','ழ','ழி','ழு','ழெ','ழொ','ள','ளி','ளு','ளெ','ளொ','ற','றி','று','றெ','றொ','ன','னி','னு','னெ','னொ']
    #uyirmeinaedil_list=['கா','கீ','கூ','கே','கை','கோ','கௌ','ஙா','ஙீ','ஙூ','ஙே','ஙை','ஙோ','ஙௌ','சா','சீ','சூ','சே','சை','சோ','சௌ','ஞா','ஞீ','ஞூ','ஞே','ஞை','ஞோ','ஞௌ','டா','டீ','டூ','டே','டை','டோ','டௌ','ணா','ணீ','ணூ','ணே','ணை','ணோ','ணௌ','தா','தீ','தூ','தே','தை','தோ','தௌ','நா','நீ','நூ','நே','நை','நோ','நௌ','பா','பீ','பூ','பே','பை','போ','பௌ','மா','மீ','மூ','மே','மை','மோ','மௌ','யா','யீ','யூ','யே','யை','யோ','யௌ','ரா','ரீ','ரூ','ரே','ரை','ரோ','ரௌ','லா','லீ','லூ','லே','லை','லோ','லௌ','வா','வீ','வூ','வே','வை','வோ','வௌ','ழா','ழீ','ழூ','ழே','ழை','ழோ','ழௌ','ளா','ளீ','ளூ','ளே','ளை','ளோ','ளௌ','றா','றீ','றூ','றே','றை','றோ','றௌ','னா','னீ','னூ','னே','னை','னோ','னௌ']
    #uyirmei_list=['க','கா','கி','கீ','கு','கூ','கெ','கே','கை','கொ','கோ','கௌ','ங','ஙா','ஙி','ஙீ','ஙு','ஙூ','ஙெ','ஙே','ஙை','ஙொ','ஙோ','ஙௌ','ச','சா','சி','சீ','சு','சூ','செ','சே','சை','சொ','சோ','சௌ','ஞ','ஞா','ஞி','ஞீ','ஞு','ஞூ','ஞெ','ஞே','ஞை','ஞொ','ஞோ','ஞௌ','ட','டா','டி','டீ','டு','டூ','டெ','டே','டை','டொ','டோ','டௌ','ண','ணா','ணி','ணீ','ணு','ணூ','ணெ','ணே','ணை','ணொ','ணோ','ணௌ','த','தா','தி','தீ','து','தூ','தெ','தே','தை','தொ','தோ','தௌ','ந','நா','நி','நீ','நு','நூ','நெ','நே','நை','நொ','நோ','நௌ','ப','பா','பி','பீ','பு','பூ','பெ','பே','பை','பொ','போ','பௌ','ம','மா','மி','மீ','மு','மூ','மெ','மே','மை','மொ','மோ','மௌ','ய','யா','யி','யீ','யு','யூ','யெ','யே','யை','யொ','யோ','யௌ','ர','ரா','ரி','ரீ','ரு','ரூ','ரெ','ரே','ரை','ரொ','ரோ','ரௌ','ல','லா','லி','லீ','லு','லூ','லெ','லே','லை','லொ','லோ','லௌ','வ','வா','வி','வீ','வு','வூ','வெ','வே','வை','வொ','வோ','வௌ','ழ','ழா','ழி','ழீ','ழு','ழூ','ழெ','ழே','ழை','ழொ','ழோ','ழௌ','ள','ளா','ளி','ளீ','ளு','ளூ','ளெ','ளே','ளை','ளொ','ளோ','ளௌ','ற','றா','றி','றீ','று','றூ','றெ','றே','றை','றொ','றோ','றௌ','ன','னா','னி','னீ','னு','னூ','னெ','னே','னை','னொ','னோ','னௌ']
    #tamil_list=['அ','ஆ','இ','ஈ','உ','ஊ','எ','ஏ','ஐ','ஒ','ஓ','ஔ','ஃ','க்','க','கா','கி','கீ','கு','கூ','கெ','கே','கை','கொ','கோ','கௌ','ங்','ங','ஙா','ஙி','ஙீ','ஙு','ஙூ','ஙெ','ஙே','ஙை','ஙொ','ஙோ','ஙௌ','ச்','ச','சா','சி','சீ','சு','சூ','செ','சே','சை','சொ','சோ','சௌ','ஞ்','ஞ','ஞா','ஞி','ஞீ','ஞு','ஞூ','ஞெ','ஞே','ஞை','ஞொ','ஞோ','ஞௌ','ட்','ட','டா','டி','டீ','டு','டூ','டெ','டே','டை','டொ','டோ','டௌ','ண்','ண','ணா','ணி','ணீ','ணு','ணூ','ணெ','ணே','ணை','ணொ','ணோ','ணௌ','த்','த','தா','தி','தீ','து','தூ','தெ','தே','தை','தொ','தோ','தௌ','ந்','ந','நா','நி','நீ','நு','நூ','நெ','நே','நை','நொ','நோ','நௌ','ப்','ப','பா','பி','பீ','பு','பூ','பெ','பே','பை','பொ','போ','பௌ','ம்','ம','மா','மி','மீ','மு','மூ','மெ','மே','மை','மொ','மோ','மௌ','ய்','ய','யா','யி','யீ','யு','யூ','யெ','யே','யை','யொ','யோ','யௌ','ர்','ர','ரா','ரி','ரீ','ரு','ரூ','ரெ','ரே','ரை','ரொ','ரோ','ரௌ','ல்','ல','லா','லி','லீ','லு','லூ','லெ','லே','லை','லொ','லோ','லௌ','வ்','வ','வா','வி','வீ','வு','வூ','வெ','வே','வை','வொ','வோ','வௌ','ழ்','ழ','ழா','ழி','ழீ','ழு','ழூ','ழெ','ழே','ழை','ழொ','ழோ','ழௌ','ள்','ள','ளா','ளி','ளீ','ளு','ளூ','ளெ','ளே','ளை','ளொ','ளோ','ளௌ','ற்','ற','றா','றி','றீ','று','றூ','றெ','றே','றை','றொ','றோ','றௌ','ன்','ன','னா','னி','னீ','னு','னூ','னெ','னே','னை','னொ','னோ','னௌ']

    for literal in utf8.get_letters(word):
        if literal in tamil_dict:
            tamil_dict[literal] += 1
            if literal in uyir_dict:
                uyir_dict[literal] +=1
                if literal in uyirkuril_dict:
                    uyirkuril_dict[literal] +=1
                else:
                    uyirnaedil_dict[literal] +=1
            if literal in mei_dict:
                mei_dict[literal] +=1
            if literal in uyirmei_dict:
                uyirmei_dict[literal] +=1
                if literal in uyirmeikuril_dict:
                    uyirmeikuril_dict[literal] +=1
                else:
                    uyirmeinaedil_dict[literal] +=1
                    
    #for item in uyirmei_dict:
    #    if uyirmei_dict[item] > 0:
    #        print(item,uyirmei_dict[item])
    
    uyir_dict = {key:val for key, val in uyir_dict.items() if val != 0}
    mei_dict = {key:val for key, val in mei_dict.items() if val != 0}
    uyirmei_dict = {key:val for key, val in uyirmei_dict.items() if val != 0}
    uyirkuril_dict = {key:val for key, val in uyirkuril_dict.items() if val != 0} 
    uyirnaedil_dict = {key:val for key, val in uyirnaedil_dict.items() if val != 0}
    uyirmeikuril_dict = {key:val for key, val in uyirmeikuril_dict.items() if val != 0}
    uyirmeinaedil_dict = {key:val for key, val in uyirmeinaedil_dict.items() if val != 0}
    tamil_dict = {key:val for key, val in tamil_dict.items() if val != 0}
    
    return uyir_dict,mei_dict,uyirmei_dict,uyirkuril_dict,uyirnaedil_dict,uyirmeikuril_dict,uyirmeinaedil_dict,tamil_dict